//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const a = 11;

// if (a === 10) {
//   console.log("Вірно");
// } else {
//   console.log("Невірно");
// }

//TODO: № 2 на тернарник =============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно' через тернарник

/* const x = 10;

console.log(x === 1 ? "Вірно" : "Невірно");
 */

//TODO: № 3 на if...else if ===============================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).
// const min = 60;
// console.log("🚀 ~ min:", min)
// if (min > 0 && min <= 15) {
//   console.log("First quoter");
// } else if (min > 15 && min <= 30) {
//   console.log("Second quoter");
// } else if (min > 30 && min <= 45) {
//   console.log("Third quoter");
// } else if (min > 45 && min <= 59) {
//   console.log("Fourth quoter");
// } else {
//   console.log("Wrong number!!!");
// }
